In [1]:
import pandas as pd

df = pd.read_csv("hw3.csv")
df.tail(2)

     Name  Age Department  Salary
6   Grace   35         IT   61000
7  Hannah   30  Marketing   47000

In [8]:
# Câu hỏi 1: Có bao nhiêu người trên 30 tuổi trong dữ liệu? 
ds_tren_30 = df.loc[df["Age"] > 30, :]
len(ds_tren_30)

3

In [13]:
# Câu hỏi 2: Tổng số tiền lương của tất cả các người có trong dữ liệu là bao nhiêu?
tong_luong = df.iloc[:, 3:].sum()
tong_luong

Salary    430000
dtype: int64

In [ ]:
# Câu hỏi 3: Có bao nhiêu người có lương lớn hơn 50,000 và tuổi nhỏ hơn 40?
# ds_luong50 = df.loc[df["Salary"] > 50000, :]
# ds_tuoi40 = ds_luong50.loc[df["Age"] < 40, :]
# viet gon hon
ds_luong50_tuoi40 = df.loc[(df["Salary"] > 50000) & (df["Age"] < 40), :]
ds_luong50_tuoi40

      Name  Age Department  Salary
1      Bob   27         IT   52000
2  Charlie   22    Finance   55000
3    David   32         IT   60000
6    Grace   35         IT   61000

## Dấu bitwise:
- & (and)
- | (or)
- ~ (not)